app/controllers/field_definitions_controller.rb

  def index
    @field_definitions = FieldDefinition.all
---
SELECT "field_definitions".* FROM "field_definitions"

  def create
    @field_definition = FieldDefinition.new(field_definition_params)

    respond_to do |format|
      if @field_definition.save
---
INSERT INTO "field_definitions" ("created_at", "errorMessage", "name", "order", "required", "step_definition_id", "updated_at", "validationRegex") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @field_definition.update(field_definition_params)
---
UPDATE "field_definitions" SET "field_type" = ?, "step_definition_id" = ?, "updated_at" = ? WHERE "field_definitions"."id" = 1  [["field_type", "TEXT"], ["step_definition_id", 1], ["updated_at", "2015-05-04 21:12:40.781964"]]

    def set_field_definition
      @field_definition = FieldDefinition.find(params[:id])
---
SELECT  "field_definitions".* FROM "field_definitions"  WHERE "field_definitions"."id" = ? LIMIT 1  [["id", 1]]