app/controllers/step_definitions_controller.rb

SELECT "step_definitions".* FROM "step_definitions"
---
  def index
    @step_definitions = StepDefinition.all

INSERT INTO "step_definitions" ("created_at", "order", "task_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-05-04 18:54:14.027396"], ["order", 0], ["task_id", 1], ["updated_at", "2015-05-04 18:54:14.027396"]]
---
  def create
    @step_definition = StepDefinition.new(step_definition_params)

    respond_to do |format|
      if @step_definition.save

SELECT  "step_definitions".* FROM "step_definitions"  WHERE "step_definitions"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_step_definition
      @step_definition = StepDefinition.find(params[:id])