app/controllers/tasks_controller.rb

SELECT "field_definitions".* FROM "field_definitions"  WHERE "field_definitions"."step_definition_id" IN (1, 2)
SELECT "step_definitions".* FROM "step_definitions"  WHERE "step_definitions"."task_id" IN (1)
SELECT "tasks".* FROM "tasks"
---
  def index
    @tasks = Task.includes([stepDefinitions: :fieldDefinitions]).all

INSERT INTO "tasks" ("created_at", "description", "name", "status", "task_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-05-07 03:10:42.895305"], ["description", ""], ["name", ""], ["status", ""], ["task_type", ""], ["updated_at", "2015-05-07 03:10:42.895305"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "task_type" = ?, "updated_at" = ? WHERE "tasks"."id" = 1  [["task_type", "Entrega"], ["updated_at", "2015-05-04 20:03:23.080065"]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)