app/controllers/users_controller.rb

  def create

    puts "------------- CREATE USER"
    puts user_params.to_json

    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2016-03-25 01:01:41.028558"], ["email", "wadijm@gmail.com"], ["name", "Wadi"], ["password", "1234"], ["updated_at", "2016-03-25 01:01:41.028558"]]